Revit 2026 API

# IExternalServiceOnServersDisparity Method

---
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
DisparityResponse OnServersDisparity(
	Document document,
	IList<Guid> oldServers
)
```
```vb
Function OnServersDisparity (
	document As Document,
	oldServers As IList(Of Guid)
) As DisparityResponse
```
```cpp
DisparityResponse OnServersDisparity(
	Document^ document,
	IList<Guid>^ oldServers
)
```
```fsharp
abstract OnServersDisparity :
        document : Document *
        oldServers : IList<Guid> -> DisparityResponse
```

#### Parameters

document Document

oldServers IListGuid

#### Return Value

DisparityResponse

#### Reference

IExternalService Interface

Autodesk.Revit.DB.ExternalService Namespace